FamInstAnalyticalHelper.createZeroLengthAnalyticalModelLine(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sometimes projecting line to plane gives a point. Because we do not want to change type,
we crate line that length is 0.8 DOUBLE_EPS. To detect point, compare line length with DOUBLE_EPS